package TIL202308;

public class TIL0801 {
    /*  자바스크립트에서 number, string, boolean, undefined, null, symbol 6가지 데이터 타입 이외의 값은 모두 객체 타입이다.

        자바스크립트의 경우 하나의 숫자 타입만 존재하고 모든 수를 실수로 처리한다.

        문자열은 작은 따옴표(’’), 큰 따옴표(""), 또는 백틱(``)으로 텍스트를 감싼다.
        자바는 문자열을 객체로 표현하지만 자바스크립트의 문자열은 원시 타입이며, 변경 불가능한 값이다.
        템플릿 리터럴(``) : ES6부터 도입 된 멀티라인 문자열, 표현식 삽입 등의 편리한 문자열 처리 기능을 제공하는 문자열 표기법이다.
        이 때는 작은 따옴표, 큰 따옴표 대신 백틱을 사용해 표현한다.

        boolean 값은 true와 false뿐이다.

        undefined 타입은 undefined 값이 유일하며 초기화 되지 않은 값을 의미한다.

        null 타입은 null 값이 유일하며 개발자가 의도적으로 값이 없다는 것을 표현하기 위해 사용한다.

        심벌은 ES6에서 추가 된 7번째 타입으로, 변경 불가능한 원시 타입의 값이다.
        다른 값과 중복 되지 않는 유일무이한 값으로 이름 충돌할 위험이 없는 객체의 유일한 프로퍼티 키를 만들기 위해 사용한다.
        심벌 이외의 원시 값은 리터럴을 통해 생성하지만 심벌은 Symbol 함수를 통해 호출해 생성한다.
        지금은 데이터 타입의 한 종류라고만 이해하고 넘어가면 된다. 심벌에 대한 자세한 내용은 ES6+ 챕터에서 다루게 된다.
         */
}
